In [2]:
!pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in e:\anaconda\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in e:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in e:\anaconda\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd

In [6]:
data={'Names':['khizar','raza','usama','raza'],
     'Marks':[72,66,64,66],
     'City':['RYK','RWP','FSD','RWp']}
df=pd.DataFrame(data)
df

    Names  Marks City
0  khizar     72  RYK
1    raza     66  RWP
2   usama     64  FSD
3    raza     66  RWp

In [8]:
df.drop_duplicates(subset='Names',keep='first')

    Names  Marks City
0  khizar     72  RYK
1    raza     66  RWP
2   usama     64  FSD

In [9]:
df.drop_duplicates(subset='Names',keep='last')

    Names  Marks City
0  khizar     72  RYK
2   usama     64  FSD
3    raza     66  RWp

In [12]:
df.drop_duplicates(subset='Names',keep=False,inplace=True)
df

    Names  Marks City
0  khizar     72  RYK
2   usama     64  FSD